app/controllers/users_controller.rb

  def show
  	@user = User.find(params[:id])
    @hobbies = UsersHobby.where(user_id: @user.id).page(params[:page]).per(5)
    @communities = UsersCommunity.where(user_id: @user.id)
---
SELECT  "users_hobbies".* FROM "users_hobbies" WHERE "users_hobbies"."user_id" = ? LIMIT ?  [["user_id", 13], ["LIMIT", 11]]