app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
SELECT "users_hobbies".* FROM "users_hobbies" WHERE "users_hobbies"."user_id" = ?  [["user_id", 1]]
---
  def show
  	@user = User.find(params[:id])
    @hobbies = UsersHobby.where(user_id: @user.id)

SELECT  "hobbies".* FROM "hobbies" WHERE "hobbies"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
SELECT  "users_hobbies".* FROM "users_hobbies" WHERE "users_hobbies"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "hobbies" WHERE "hobbies"."id" = ?  [["id", 5]]
DELETE FROM "users_hobbies" WHERE "users_hobbies"."id" = ?  [["id", 5]]
---
  def hobby_delete
    uh = UsersHobby.find(params[:hobby_id])
    if uh.destroy

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
UPDATE "users" SET "image_id" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["image_id", "676ec4d4c49df623d97c0482c143e557b876776f02d3020f0c64aaa09bb8"], ["introduction", ""], ["updated_at", "2019-02-13 06:18:45.389344"], ["id", 13]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
SELECT  "hobbies".* FROM "hobbies" WHERE "hobbies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users_hobbies".* FROM "users_hobbies" WHERE "users_hobbies"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
  def hobby_index
    @user = User.find(params[:id])
    @hobby = UsersHobby.find(params[:hobby_id])

INSERT INTO "records" ("user_id", "hobby_id", "time", "date", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["user_id", 1], ["hobby_id", 1], ["time", 2], ["date", "2019-02-10"], ["comment", "カーブボール"], ["created_at", "2019-02-11 12:50:04.089757"], ["updated_at", "2019-02-11 12:50:04.089757"]]
---
  def record_create
    user = params[:user_id]
    hobby = params[:hobby_id]
    record = Record.new(record_params)
    record.user_id = user
    record.hobby_id = hobby
    if record.save